# Clase 12

## Pandas DataFrame

los dataframe son tablas parecidas a una hoja de calculo, contienen filas y columnas. cada una de estas filas individualmente es una Serie

## Ejercicio 1.0

In [48]:
!pip install pandas==2.2.2

Requirement already satisfied: pandas==2.2.2 in c:\python312\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in c:\python312\lib\site-packages (from pandas==2.2.2) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\olga\appdata\roaming\python\python312\site-packages (from pandas==2.2.2) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\python312\lib\site-packages (from pandas==2.2.2) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\python312\lib\site-packages (from pandas==2.2.2) (2024.1)
Requirement already satisfied: six>=1.5 in c:\users\olga\appdata\roaming\python\python312\site-packages (from python-dateutil>=2.8.2->pandas==2.2.2) (1.16.0)

In [49]:
import pandas as pd
import numpy as np

## Ejercicio 1.1

creacion objeto DataFrame

In [50]:
# creamos un dataframe extrayendo los datos de las listas
lista_p1 = ["Juan Pablo", "Simone", 54, False]
lista_p2 = ["Yul","Mourad",46,True]
lista_p3 = ["Carlos","Alverca",75,False]
lista_p4 = ["Jorge","Rodriguez",38,False]
lista_p5 = ["Sebastian","First",48,False]
lista_p6 = ["Mabel","Guzman",26,False]
lista_p7 = ["Yanina","Delgado",29,False]
lista_p8 = ["Marina","Mery",49,False]

lista_nombre_columnas = ["Nombre","Apellido","Edad","Es metido?"]

df_alumnos = pd.DataFrame(
    data = [lista_p1,lista_p2,lista_p3,lista_p4,lista_p5,lista_p6,lista_p7,lista_p8],
    columns = lista_nombre_columnas
)
df_alumnos

       Nombre   Apellido  Edad  Es metido?
0  Juan Pablo     Simone    54       False
1         Yul     Mourad    46        True
2      Carlos    Alverca    75       False
3       Jorge  Rodriguez    38       False
4   Sebastian      First    48       False
5       Mabel     Guzman    26       False
6      Yanina    Delgado    29       False
7      Marina       Mery    49       False

In [51]:
# podemos crear un dataFrame extrayendo los datos de un diccionario

diccionario_empleados = {
    "Nombre" : ["Mara","Mirta","Jose","Juana"],
    "Departamento" : ["Sales","IT","IT","JR"],
    "Suledo_usd" : [1200,5000,7600,8000],
    "Facturacion" : [True,True,False,True]
}
diccionario_empleados

{'Nombre': ['Mara', 'Mirta', 'Jose', 'Juana'],
 'Departamento': ['Sales', 'IT', 'IT', 'JR'],
 'Suledo_usd': [1200, 5000, 7600, 8000],
 'Facturacion': [True, True, False, True]}

In [52]:
df_empleados = pd.DataFrame(diccionario_empleados)

df_empleados

  Nombre Departamento  Suledo_usd  Facturacion
0   Mara        Sales        1200         True
1  Mirta           IT        5000         True
2   Jose           IT        7600        False
3  Juana           JR        8000         True

In [53]:
rng = np.random.default_rng()

In [54]:
array_5x3 = rng.integers(1,20,(5,3)) #creacion array
print(array_5x3)

[[ 5 18  2]
 [15 18 10]
 [ 8 19 17]
 [ 5 13 11]
 [ 5 19 15]]

In [55]:
array_5x3.ndim

2

In [56]:
array_5x3.shape

(5, 3)

In [57]:
#tambien podemos crear un dataframe a partir de un array

## Ejercicio 1.2

podemos trabajar con indices personalizados

In [58]:
# Estamos integrando el indice a partir de una lista

# dataframe catalogo vehiculos disponibles en una concecionaria

lista_patente = ["GHY-548","ERG-105","TPE-485","POL-896"]

lista_v1 = ["Ford","Mustang",100000,True]
lista_v2 = ["Fiat","500",50000,False]
lista_v3 = ["Toyota","Yaris",75000,True]
lista_v4 = ["Toyota","Corolla",150000,True]

lista_encabezado_concecionaria = ["Marca", "Modelo", "Precio", "0Km"]

df_vehiculos = pd.DataFrame(
    data = [lista_v1,lista_v2,lista_v3,lista_v4],
    columns = lista_encabezado_concecionaria,
    index = lista_patente
)
df_vehiculos

          Marca   Modelo  Precio    0Km
GHY-548    Ford  Mustang  100000   True
ERG-105    Fiat      500   50000  False
TPE-485  Toyota    Yaris   75000   True
POL-896  Toyota  Corolla  150000   True

In [59]:
# Podemos seleccionar el indice desde una columna de mi dataframe

#Tengo un diccionario con empleados
diccionario_empleados = {
  "ID":["F-001","C-001","F-002","F-003","F-004","C-002"],
  "Nombre":["Andres","Sofia","Mercedes","Pablo","Claudia","Miguel"],
  "Apellido":["Muñoz","Cerves","Garcia","Alaves","Perez","Solis"],
  "Sueldo":[4500,6000,2300,5300,4920,5000],
  "Departamento":["IT","Sales","IT","IT","HR","Sales"],
  "Facturacion":[True,True,False,True,True,False]
}

df_empleado2 = pd.DataFrame(diccionario_empleados)
df_empleado2

      ID    Nombre Apellido  Sueldo Departamento  Facturacion
0  F-001    Andres    Muñoz    4500           IT         True
1  C-001     Sofia   Cerves    6000        Sales         True
2  F-002  Mercedes   Garcia    2300           IT        False
3  F-003     Pablo   Alaves    5300           IT         True
4  F-004   Claudia    Perez    4920           HR         True
5  C-002    Miguel    Solis    5000        Sales        False

In [60]:

df_empleado2.set_index("ID", inplace=True)
df_empleado2

         Nombre Apellido  Sueldo Departamento  Facturacion
ID
F-001    Andres    Muñoz    4500           IT         True
C-001     Sofia   Cerves    6000        Sales         True
F-002  Mercedes   Garcia    2300           IT        False
F-003     Pablo   Alaves    5300           IT         True
F-004   Claudia    Perez    4920           HR         True
C-002    Miguel    Solis    5000        Sales        False

In [61]:
# El indice pueden ser fechas

dias = pd.date_range(start='2024-01-10', end='2024-04-19')

df_resumen_ventas = pd.DataFrame(
    data = {
        "nro_ventas":rng.integers(10,50,len(dias)),
        "ganancia":rng.random(len(dias)).round(2),
        "ingresos_en_miles_usd":rng.integers(100,2000,len(dias))
    },
    index=dias)
df_resumen_ventas

            nro_ventas  ganancia  ingresos_en_miles_usd
2024-01-10          21      0.36                   1872
2024-01-11          42      0.21                    806
2024-01-12          36      0.95                   1113
2024-01-13          38      0.28                    313
2024-01-14          37      0.50                   1195
...                ...       ...                    ...
2024-04-15          35      0.11                    378
2024-04-16          23      0.05                   1827
2024-04-17          28      0.90                   1609
2024-04-18          23      0.19                    981
2024-04-19          37      0.02                   1208

[101 rows x 3 columns]

## Ejercicio 1.3

Repaso metodos importantes que sirven para trabajar con dataframes

In [62]:
df_resumen_ventas.head(7)  #Head nos trae los primeros N elementos

            nro_ventas  ganancia  ingresos_en_miles_usd
2024-01-10          21      0.36                   1872
2024-01-11          42      0.21                    806
2024-01-12          36      0.95                   1113
2024-01-13          38      0.28                    313
2024-01-14          37      0.50                   1195
2024-01-15          16      0.49                   1608
2024-01-16          24      0.21                   1240

In [63]:
df_resumen_ventas.tail()  #Tail trae los ultimos N elementos, el valor por defecto es 5

            nro_ventas  ganancia  ingresos_en_miles_usd
2024-04-15          35      0.11                    378
2024-04-16          23      0.05                   1827
2024-04-17          28      0.90                   1609
2024-04-18          23      0.19                    981
2024-04-19          37      0.02                   1208

In [64]:
df_resumen_ventas.describe() #Uso describe

       nro_ventas    ganancia  ingresos_en_miles_usd
count  101.000000  101.000000             101.000000
mean    27.227723    0.404158            1184.613861
std     11.388486    0.296575             528.971114
min     10.000000    0.010000             104.000000
25%     17.000000    0.180000             882.000000
50%     25.000000    0.350000            1208.000000
75%     37.000000    0.650000            1652.000000
max     49.000000    0.990000            1992.000000

In [65]:
df_resumen_ventas.shape #Tenemos 101 filas por 3 columnas

(101, 3)

In [66]:
df_resumen_ventas.nro_ventas #Aisla la columna -> Serie

2024-01-10    21
2024-01-11    42
2024-01-12    36
2024-01-13    38
2024-01-14    37
              ..
2024-04-15    35
2024-04-16    23
2024-04-17    28
2024-04-18    23
2024-04-19    37
Freq: D, Name: nro_ventas, Length: 101, dtype: int64

In [67]:
df_resumen_ventas[df_resumen_ventas.ingresos_en_miles_usd > 1400] #Puedo filtrar mi dataframe aplicandole una regla a una columna (Series)

            nro_ventas  ganancia  ingresos_en_miles_usd
2024-01-10          21      0.36                   1872
2024-01-15          16      0.49                   1608
2024-01-20          21      0.99                   1913
2024-01-22          45      0.02                   1448
2024-01-26          15      0.18                   1605
2024-01-27          16      0.06                   1779
2024-01-31          28      0.43                   1421
2024-02-03          35      0.16                   1988
2024-02-04          12      0.33                   1869
2024-02-07          40      0.43                   1664
2024-02-11          12      0.23                   1537
2024-02-18          13      0.85                   1726
2024-02-23          24      0.05                   1442
2024-02-25          27      0.03                   1992
2024-02-28          34      0.21                   1942
2024-03-02          22      0.01                   1440
2024-03-04          41      0.46                   1899
2024-03-05          11      0.18                   1702
2024-03-06          22      0.07                   1551
2024-03-07          42      0.04                   1974
2024-03-08          23      0.24                   1710
2024-03-09          23      0.34                   1792
2024-03-11          20      0.28                   1934
2024-03-12          40      0.38                   1951
2024-03-15          32      0.25                   1596
2024-03-22          41      0.37                   1656
2024-03-24          23      0.51                   1652
2024-03-27          13      0.35                   1722
2024-03-28          12      0.23                   1781
2024-03-29          18      0.42                   1831
2024-03-30          44      0.82                   1842
2024-03-31          12      0.83                   1654
2024-04-06          18      0.10                   1872
2024-04-09          12      0.21                   1468
2024-04-13          39      0.19                   1963
2024-04-16          23      0.05                   1827
2024-04-17          28      0.90                   1609

In [68]:
 #Podemos concatenar diferentes reglas

df_resumen_ventas[(df_resumen_ventas.nro_ventas > 40) & (df_resumen_ventas.ingresos_en_miles_usd > 1600)]

            nro_ventas  ganancia  ingresos_en_miles_usd
2024-03-04          41      0.46                   1899
2024-03-07          42      0.04                   1974
2024-03-22          41      0.37                   1656
2024-03-30          44      0.82                   1842

In [69]:
df_resumen_ventas.iloc[0] #Obtenemos el primer elemento

nro_ventas                 21.00
ganancia                    0.36
ingresos_en_miles_usd    1872.00
Name: 2024-01-10 00:00:00, dtype: float64

In [70]:
df_resumen_ventas.iloc[3] #Obtenemos el cuarto elemento

nro_ventas                38.00
ganancia                   0.28
ingresos_en_miles_usd    313.00
Name: 2024-01-13 00:00:00, dtype: float64

In [71]:
df_resumen_ventas.iloc[-1] #Ultimo elemento

nro_ventas                 37.00
ganancia                    0.02
ingresos_en_miles_usd    1208.00
Name: 2024-04-19 00:00:00, dtype: float64

In [72]:
df_resumen_ventas.iloc[4:10] #Filtrado desde la posicion 4 (incluida) hasta la 10(excluida)

            nro_ventas  ganancia  ingresos_en_miles_usd
2024-01-14          37      0.50                   1195
2024-01-15          16      0.49                   1608
2024-01-16          24      0.21                   1240
2024-01-17          17      0.12                   1377
2024-01-18          27      0.94                   1271
2024-01-19          13      0.60                    346

In [73]:
df_resumen_ventas.iloc[:9] #El filtrado termina en 9 elemento

            nro_ventas  ganancia  ingresos_en_miles_usd
2024-01-10          21      0.36                   1872
2024-01-11          42      0.21                    806
2024-01-12          36      0.95                   1113
2024-01-13          38      0.28                    313
2024-01-14          37      0.50                   1195
2024-01-15          16      0.49                   1608
2024-01-16          24      0.21                   1240
2024-01-17          17      0.12                   1377
2024-01-18          27      0.94                   1271

In [74]:
df_resumen_ventas.iloc[-15:] #El filtrado inicia desde el -15 adelante

            nro_ventas  ganancia  ingresos_en_miles_usd
2024-04-05          29      0.68                   1271
2024-04-06          18      0.10                   1872
2024-04-07          23      0.97                    237
2024-04-08          20      0.83                   1315
2024-04-09          12      0.21                   1468
2024-04-10          47      0.38                    726
2024-04-11          36      0.25                   1026
2024-04-12          44      0.96                    963
2024-04-13          39      0.19                   1963
2024-04-14          31      0.11                    914
2024-04-15          35      0.11                    378
2024-04-16          23      0.05                   1827
2024-04-17          28      0.90                   1609
2024-04-18          23      0.19                    981
2024-04-19          37      0.02                   1208

In [75]:
df_resumen_ventas.sort_values(by="ganancia") #Ordenamos de menor a mayor nuestro dataframe en funcion de la ganancia

            nro_ventas  ganancia  ingresos_en_miles_usd
2024-03-02          22      0.01                   1440
2024-04-19          37      0.02                   1208
2024-03-19          17      0.02                    541
2024-02-02          23      0.02                   1167
2024-02-01          37      0.02                    967
...                ...       ...                    ...
2024-04-12          44      0.96                    963
2024-01-24          37      0.96                    559
2024-04-07          23      0.97                    237
2024-02-24          17      0.98                    559
2024-01-20          21      0.99                   1913

[101 rows x 3 columns]

In [76]:
#Ordenamos de mayor a menor nuestro dataframe en funcion de ingresos_mil_usd

df_resumen_ventas.sort_values(by="ingresos_en_miles_usd",ascending= False)

            nro_ventas  ganancia  ingresos_en_miles_usd
2024-02-25          27      0.03                   1992
2024-02-03          35      0.16                   1988
2024-03-07          42      0.04                   1974
2024-04-13          39      0.19                   1963
2024-03-12          40      0.38                   1951
...                ...       ...                    ...
2024-01-30          44      0.28                    226
2024-02-17          13      0.70                    219
2024-03-17          18      0.75                    181
2024-03-03          15      0.60                    111
2024-02-08          47      0.04                    104

[101 rows x 3 columns]

## Ejercicio 1.4

Los dataframes son editables podemos cambiar aspectos como:
* Renombrar columnas e indices en dataframe

In [77]:
dict_concesionaria = {
    'marca': ['Ford','Toyota','Audi','Ford','Ford','Renault','Chevrolet','Ford','Ford','Volkswagen','Honda','BMW','Mercedes-Benz','Ford','Ford'],
    'modelo': ['Focus','Hilux','A3','Mustang','F-100','Cactus','Spark','Escape','Explorer','Gol','Civic','X5','Clase C','Ranger','Fusion'],
    'precio': [3000,10000,10000,20000,2000,3500,4000,18000,25000,6000,8000,15000,12000,22000,17000],
    '0Km': [True,True,True,True,False,True,False,True,False,True,True,True,False,True,False]
  }
dict_concesionaria

{'marca': ['Ford',
  'Toyota',
  'Audi',
  'Ford',
  'Ford',
  'Renault',
  'Chevrolet',
  'Ford',
  'Ford',
  'Volkswagen',
  'Honda',
  'BMW',
  'Mercedes-Benz',
  'Ford',
  'Ford'],
 'modelo': ['Focus',
  'Hilux',
  'A3',
  'Mustang',
  'F-100',
  'Cactus',
  'Spark',
  'Escape',
  'Explorer',
  'Gol',
  'Civic',
  'X5',
  'Clase C',
  'Ranger',
  'Fusion'],
 'precio': [3000,
  10000,
  10000,
  20000,
  2000,
  3500,
  4000,
  18000,
  25000,
  6000,
  8000,
  15000,
  12000,
  22000,
  17000],
 '0Km': [True,
  True,
  True,
  True,
  False,
  True,
  False,
  True,
  False,
  True,
  True,
  True,
  False,
  True,
  False]}

In [78]:
df_conce = pd.DataFrame(dict_concesionaria)
df_conce

            marca    modelo  precio    0Km
0            Ford     Focus    3000   True
1          Toyota     Hilux   10000   True
2            Audi        A3   10000   True
3            Ford   Mustang   20000   True
4            Ford     F-100    2000  False
5         Renault    Cactus    3500   True
6       Chevrolet     Spark    4000  False
7            Ford    Escape   18000   True
8            Ford  Explorer   25000  False
9      Volkswagen       Gol    6000   True
10          Honda     Civic    8000   True
11            BMW        X5   15000   True
12  Mercedes-Benz   Clase C   12000  False
13           Ford    Ranger   22000   True
14           Ford    Fusion   17000  False

In [79]:

#Podemos aplicar multiples condiciones que incluyan strings, booleanos e integers

df_conce[(df_conce.marca == "Ford") & (df_conce["precio"] > 10000) & (df_conce["0Km"] == True)]

 #Podemos aplicar la busqueda usando los corchetes y pasando el nombre de la columna

   marca   modelo  precio   0Km
3   Ford  Mustang   20000  True
7   Ford   Escape   18000  True
13  Ford   Ranger   22000  True

### Podemos cambiar todos los nombres de las columnas

In [80]:
df_conce.head()

    marca   modelo  precio    0Km
0    Ford    Focus    3000   True
1  Toyota    Hilux   10000   True
2    Audi       A3   10000   True
3    Ford  Mustang   20000   True
4    Ford    F-100    2000  False

In [81]:
#Si queremos renombrar una columna debemos aplicar

nuevas_columns = {
    "marca":"MARCA",
    "modelo":"NOMBRE",
    "precio":"PRECIO_USD",
    "0Km":"UNICO_DUENO"
}

df_conce.rename(columns=nuevas_columns, inplace= True)

In [82]:
df_conce

            MARCA    NOMBRE  PRECIO_USD  UNICO_DUENO
0            Ford     Focus        3000         True
1          Toyota     Hilux       10000         True
2            Audi        A3       10000         True
3            Ford   Mustang       20000         True
4            Ford     F-100        2000        False
5         Renault    Cactus        3500         True
6       Chevrolet     Spark        4000        False
7            Ford    Escape       18000         True
8            Ford  Explorer       25000        False
9      Volkswagen       Gol        6000         True
10          Honda     Civic        8000         True
11            BMW        X5       15000         True
12  Mercedes-Benz   Clase C       12000        False
13           Ford    Ranger       22000         True
14           Ford    Fusion       17000        False

In [83]:
#Si queremos renombrar una columna debemos aplicar

df_conce.rename(columns={"MARCA":"MODELO"}, inplace=True)

df_conce

           MODELO    NOMBRE  PRECIO_USD  UNICO_DUENO
0            Ford     Focus        3000         True
1          Toyota     Hilux       10000         True
2            Audi        A3       10000         True
3            Ford   Mustang       20000         True
4            Ford     F-100        2000        False
5         Renault    Cactus        3500         True
6       Chevrolet     Spark        4000        False
7            Ford    Escape       18000         True
8            Ford  Explorer       25000        False
9      Volkswagen       Gol        6000         True
10          Honda     Civic        8000         True
11            BMW        X5       15000         True
12  Mercedes-Benz   Clase C       12000        False
13           Ford    Ranger       22000         True
14           Ford    Fusion       17000        False

In [85]:
#Podemos aplicar/renombrar nuestro indice generado por defecto

df_conce.index.rename(name="ID", inplace=True)

df_conce

           MODELO    NOMBRE  PRECIO_USD  UNICO_DUENO
ID
0            Ford     Focus        3000         True
1          Toyota     Hilux       10000         True
2            Audi        A3       10000         True
3            Ford   Mustang       20000         True
4            Ford     F-100        2000        False
5         Renault    Cactus        3500         True
6       Chevrolet     Spark        4000        False
7            Ford    Escape       18000         True
8            Ford  Explorer       25000        False
9      Volkswagen       Gol        6000         True
10          Honda     Civic        8000         True
11            BMW        X5       15000         True
12  Mercedes-Benz   Clase C       12000        False
13           Ford    Ranger       22000         True
14           Ford    Fusion       17000        False

In [86]:
df_resumen_ventas.head()

            nro_ventas  ganancia  ingresos_en_miles_usd
2024-01-10          21      0.36                   1872
2024-01-11          42      0.21                    806
2024-01-12          36      0.95                   1113
2024-01-13          38      0.28                    313
2024-01-14          37      0.50                   1195

In [87]:
df_resumen_ventas.index.rename(name="dia", inplace=True)
df_resumen_ventas.rename(columns={"ganancia":"ganancia_%"}, inplace=True)
df_resumen_ventas

            nro_ventas  ganancia_%  ingresos_en_miles_usd
dia
2024-01-10          21        0.36                   1872
2024-01-11          42        0.21                    806
2024-01-12          36        0.95                   1113
2024-01-13          38        0.28                    313
2024-01-14          37        0.50                   1195
...                ...         ...                    ...
2024-04-15          35        0.11                    378
2024-04-16          23        0.05                   1827
2024-04-17          28        0.90                   1609
2024-04-18          23        0.19                    981
2024-04-19          37        0.02                   1208

[101 rows x 3 columns]

## Ejercicio 1.5

como agregar o concatenar elementos a un dataframe

In [88]:
df_conce.rename(columns={"MODELO":"MARCA","NOMBRE":"MODELO"}, inplace=True)
df_conce  #Tenemos nuestro dataframe

            MARCA    MODELO  PRECIO_USD  UNICO_DUENO
ID
0            Ford     Focus        3000         True
1          Toyota     Hilux       10000         True
2            Audi        A3       10000         True
3            Ford   Mustang       20000         True
4            Ford     F-100        2000        False
5         Renault    Cactus        3500         True
6       Chevrolet     Spark        4000        False
7            Ford    Escape       18000         True
8            Ford  Explorer       25000        False
9      Volkswagen       Gol        6000         True
10          Honda     Civic        8000         True
11            BMW        X5       15000         True
12  Mercedes-Benz   Clase C       12000        False
13           Ford    Ranger       22000         True
14           Ford    Fusion       17000        False

In [89]:
df_conce.shape #tenemos 15 filas y 4 columnas

(15, 4)

In [90]:
#Añado una nueva fila

new_vehiculo = pd.DataFrame(data=[
    ["Fiat","500",1200,False]
    ],
    columns=["MARCA","MODELO","PRECIO_USD","UNICO_DUENO"]
)
pd.concat([df_conce, new_vehiculo])

            MARCA    MODELO  PRECIO_USD  UNICO_DUENO
0            Ford     Focus        3000         True
1          Toyota     Hilux       10000         True
2            Audi        A3       10000         True
3            Ford   Mustang       20000         True
4            Ford     F-100        2000        False
5         Renault    Cactus        3500         True
6       Chevrolet     Spark        4000        False
7            Ford    Escape       18000         True
8            Ford  Explorer       25000        False
9      Volkswagen       Gol        6000         True
10          Honda     Civic        8000         True
11            BMW        X5       15000         True
12  Mercedes-Benz   Clase C       12000        False
13           Ford    Ranger       22000         True
14           Ford    Fusion       17000        False
0            Fiat       500        1200        False

In [91]:
#Puedo "sobreescribir" para tener todos los vehiculos en este dataframe

df_conce = pd.concat([df_conce, new_vehiculo], ignore_index=True) #Ignoramos el indice para que nuevo_vehiculo tenga un indice que continue con los numeros previos

df_conce

            MARCA    MODELO  PRECIO_USD  UNICO_DUENO
0            Ford     Focus        3000         True
1          Toyota     Hilux       10000         True
2            Audi        A3       10000         True
3            Ford   Mustang       20000         True
4            Ford     F-100        2000        False
5         Renault    Cactus        3500         True
6       Chevrolet     Spark        4000        False
7            Ford    Escape       18000         True
8            Ford  Explorer       25000        False
9      Volkswagen       Gol        6000         True
10          Honda     Civic        8000         True
11            BMW        X5       15000         True
12  Mercedes-Benz   Clase C       12000        False
13           Ford    Ranger       22000         True
14           Ford    Fusion       17000        False
15           Fiat       500        1200        False

In [92]:
df_conce.shape

(16, 4)

In [93]:
#Podemos agregar varios filas a la vez

vehiculos_import = pd.DataFrame(data={
    'MARCA': ['Bugatti','Ferrari','Audi'],
    'MODELO': ['Chiron','Enzo','R8'],
    'PRECIO_USD': [3210000,3200000,250000],
    'UNICO_DUENO': [True,True,True]
})
df_conce = pd.concat([df_conce, vehiculos_import], ignore_index=True)

df_conce

            MARCA    MODELO  PRECIO_USD  UNICO_DUENO
0            Ford     Focus        3000         True
1          Toyota     Hilux       10000         True
2            Audi        A3       10000         True
3            Ford   Mustang       20000         True
4            Ford     F-100        2000        False
5         Renault    Cactus        3500         True
6       Chevrolet     Spark        4000        False
7            Ford    Escape       18000         True
8            Ford  Explorer       25000        False
9      Volkswagen       Gol        6000         True
10          Honda     Civic        8000         True
11            BMW        X5       15000         True
12  Mercedes-Benz   Clase C       12000        False
13           Ford    Ranger       22000         True
14           Ford    Fusion       17000        False
15           Fiat       500        1200        False
16        Bugatti    Chiron     3210000         True
17        Ferrari      Enzo     3200000         True
18           Audi        R8      250000         True

In [94]:
df_conce.shape #Vemos como cambio la cantidad de filas y columnas

(19, 4)

In [95]:
#Tenemos que tener mucha precaucion ya que si no coinciden las columnas los valores se van a agregar generando nuevas columnas

vehiculos_import = pd.DataFrame(data={
    'fabricante': ['Bugatti','Ferrari','Audi'],
    'modelo': ['Chiron','Enzo','R8'],
    'costo': [3210000,3200000,250000],
    '0km': [True,True,True]
})
df_conce = pd.concat([df_conce, vehiculos_import], ignore_index=True)

df_conce

,MARCA,MODELO,PRECIO_USD,UNICO_DUENO,fabricante,modelo,costo,0km
0,Ford,Focus,3000.0,True,NaN,NaN,NaN,NaN
1,Toyota,Hilux,10000.0,True,NaN,NaN,NaN,NaN
2,Audi,A3,10000.0,True,NaN,NaN,NaN,NaN
3,Ford,Mustang,20000.0,True,NaN,NaN,NaN,NaN
4,Ford,F-100,2000.0,False,NaN,NaN,NaN,NaN
5,Renault,Cactus,3500.0,True,NaN,NaN,NaN,NaN
6,Chevrolet,Spark,4000.0,False,NaN,NaN,NaN,NaN
7,Ford,Escape,18000.0,True,NaN,NaN,NaN,NaN
8,Ford,Explorer,25000.0,False,NaN,NaN,NaN,NaN
9,Volkswagen,Gol,6000.0,True,NaN,NaN,NaN,NaN
10,Honda,Civic,8000.0,True,NaN,NaN,NaN,NaN
11,BMW,X5,15000.0,True,NaN,NaN,NaN,NaN
12,Mercedes-Benz,Clase C,12000.0,False,NaN,NaN,NaN,NaN
13,Ford,Ranger,22000.0,True,NaN,NaN,NaN,NaN
14,Ford,Fusion,17000.0,False,NaN,NaN,NaN,NaN
15,Fiat,500,1200.0,False,NaN,NaN,NaN,NaN
16,Bugatti,Chiron,3210000.0,True,NaN,NaN,NaN,NaN
17,Ferrari,Enzo,3200000.0,True,NaN,NaN,NaN,NaN
18,Audi,R8,250000.0,True,NaN,NaN,NaN,NaN
19,NaN,NaN,NaN,NaN,Bugatti,Chiron,3210000.0,True
20,NaN,NaN,NaN,NaN,Ferrari,Enzo,3200000.0,True
21,NaN,NaN,NaN,NaN,Audi,R8,250000.0,True

In [96]:
df_conce.shape #Vemos que ahora se duplicaron la cantidad de columnas

(22, 8)

## Ejercicio 1.6

Con los dataframe hay otra opcion muy usada y es el merge

In [97]:

df_empleados_cobro = pd.DataFrame({
    'ID': [101, 102, 103, 104],
    'Sueldo': [5000, 6000, 4500, 5500],
    'Facturacion': [True, True, False, True],
    'Antiguedad': [3, 5, 2, 8]
})

df_empleados_info = pd.DataFrame({
    'ID': [101, 102, 105, 106],
    'Edad': [31, 36, 29, 41],
    'Cargo': ['Analista', 'Gerente', 'Analista', 'Director'],
    'Nombre':["Pedro","Camila",'Mariano','Federico']
})

In [98]:
df_empleados_cobro

    ID  Sueldo  Facturacion  Antiguedad
0  101    5000         True           3
1  102    6000         True           5
2  103    4500        False           2
3  104    5500         True           8

In [99]:
df_empleados_info

    ID  Edad     Cargo    Nombre
0  101    31  Analista     Pedro
1  102    36   Gerente    Camila
2  105    29  Analista   Mariano
3  106    41  Director  Federico

In [103]:
#Left merge

df_let_merge = pd.merge(df_empleados_cobro,df_empleados_info,how="left",on='ID')
df_let_merge

    ID  Sueldo  Facturacion  Antiguedad  Edad     Cargo  Nombre
0  101    5000         True           3  31.0  Analista   Pedro
1  102    6000         True           5  36.0   Gerente  Camila
2  103    4500        False           2   NaN       NaN     NaN
3  104    5500         True           8   NaN       NaN     NaN

In [104]:
#Right merge (join sql)

df_right_merge = pd.merge(df_empleados_cobro,df_empleados_info,how="right",on='ID')

df_right_merge

    ID  Sueldo Facturacion  Antiguedad  Edad     Cargo    Nombre
0  101  5000.0        True         3.0    31  Analista     Pedro
1  102  6000.0        True         5.0    36   Gerente    Camila
2  105     NaN         NaN         NaN    29  Analista   Mariano
3  106     NaN         NaN         NaN    41  Director  Federico

In [105]:

df_empleados = pd.DataFrame({
    'ID': [101, 102, 103, 104],
    'Sueldo': [5000, 6000, 4500, 5500],
    'Edad': [30, 35, 28, 40],
    'Cargo': ['Analista', 'Gerente', 'Analista', 'Director'],
    'Facturacion': [True, True, False, True],
    'Antiguedad': [3, 5, 2, 8],
    'Departamento_ID':[1,2,4,3]
})
df_departamentos = pd.DataFrame({
    'Departamento_ID':[1,2,3],
    'Nombre':["Sales","IT","HR"],
    'Piso':[1,2,2],
    'Rotacion_24hs':[True,True,False]
})

In [106]:
df_empleados

    ID  Sueldo  Edad     Cargo  Facturacion  Antiguedad  Departamento_ID
0  101    5000    30  Analista         True           3                1
1  102    6000    35   Gerente         True           5                2
2  103    4500    28  Analista        False           2                4
3  104    5500    40  Director         True           8                3

In [107]:
df_departamentos

   Departamento_ID Nombre  Piso  Rotacion_24hs
0                1  Sales     1           True
1                2     IT     2           True
2                3     HR     2          False

In [108]:
#Inner merge

df_inner_merge = pd.merge(df_empleados,df_departamentos,how="inner",on="Departamento_ID")

df_inner_merge

,ID,Sueldo,Edad,Cargo,Facturacion,Antiguedad,Departamento_ID,Nombre,Piso,Rotacion_24hs
0,101,5000,30,Analista,True,3,1,Sales,1,True
1,102,6000,35,Gerente,True,5,2,IT,2,True
2,104,5500,40,Director,True,8,3,HR,2,False

In [109]:
#Outer merge

df_outer_merge = pd.merge(df_empleados,df_departamentos,how="outer",on="Departamento_ID")

df_outer_merge

,ID,Sueldo,Edad,Cargo,Facturacion,Antiguedad,Departamento_ID,Nombre,Piso,Rotacion_24hs
0,101,5000,30,Analista,True,3,1,Sales,1.0,True
1,102,6000,35,Gerente,True,5,2,IT,2.0,True
2,103,4500,28,Analista,False,2,4,NaN,NaN,NaN
3,104,5500,40,Director,True,8,3,HR,2.0,False

## Ejercicio 1.7

En pandas podemos trabajar con los nulos, los cuales son valores faltantes o informacion perdida

In [110]:

semana = pd.date_range(start='2024-04-08', end='2024-04-14')

df_resumen_ventas = pd.DataFrame(
    data = {
        "clientes":[10,np.nan,12,16,20,np.nan,14],
        "pedidos":[4,2,14,10,1,10,12],
        "ingresos":[np.nan,20000,4500,7000,np.nan,5900,12000]
    },
    index=semana)
df_resumen_ventas

            clientes  pedidos  ingresos
2024-04-08      10.0        4       NaN
2024-04-09       NaN        2   20000.0
2024-04-10      12.0       14    4500.0
2024-04-11      16.0       10    7000.0
2024-04-12      20.0        1       NaN
2024-04-13       NaN       10    5900.0
2024-04-14      14.0       12   12000.0

In [111]:
#Vemos que valores son nulos
df_resumen_ventas.isnull ()

            clientes  pedidos  ingresos
2024-04-08     False    False      True
2024-04-09      True    False     False
2024-04-10     False    False     False
2024-04-11     False    False     False
2024-04-12     False    False      True
2024-04-13      True    False     False
2024-04-14     False    False     False

In [112]:
#Calculo de cuantas filas contienen nulos
df_resumen_ventas.isnull().sum()

clientes    2
pedidos     0
ingresos    2
dtype: int64

In [113]:
#Deja solo las filas sin nulos
df_resumen_ventas.dropna()

            clientes  pedidos  ingresos
2024-04-10      12.0       14    4500.0
2024-04-11      16.0       10    7000.0
2024-04-14      14.0       12   12000.0

In [115]:
#Deja solo las columnas sin nulos
df_resumen_ventas.dropna(axis=1)

            pedidos
2024-04-08        4
2024-04-09        2
2024-04-10       14
2024-04-11       10
2024-04-12        1
2024-04-13       10
2024-04-14       12

In [116]:
# Rellenar los valores nulos con 0
df_resumen_ventas.fillna(0)

            clientes  pedidos  ingresos
2024-04-08      10.0        4       0.0
2024-04-09       0.0        2   20000.0
2024-04-10      12.0       14    4500.0
2024-04-11      16.0       10    7000.0
2024-04-12      20.0        1       0.0
2024-04-13       0.0       10    5900.0
2024-04-14      14.0       12   12000.0

In [118]:
df_resumen_ventas.median()

clientes      14.0
pedidos       10.0
ingresos    7000.0
dtype: float64

In [119]:
#Reemplaza la media con la media de cada columna
df_resumen_ventas.fillna(df_resumen_ventas.median())

            clientes  pedidos  ingresos
2024-04-08      10.0        4    7000.0
2024-04-09      14.0        2   20000.0
2024-04-10      12.0       14    4500.0
2024-04-11      16.0       10    7000.0
2024-04-12      20.0        1    7000.0
2024-04-13      14.0       10    5900.0
2024-04-14      14.0       12   12000.0

In [120]:
#Se puede interpolar, aunque solo es recomendable cuando matematicamente la operacion tiene sentido
df_resumen_ventas.interpolate()

            clientes  pedidos  ingresos
2024-04-08      10.0        4       NaN
2024-04-09      11.0        2   20000.0
2024-04-10      12.0       14    4500.0
2024-04-11      16.0       10    7000.0
2024-04-12      20.0        1    6450.0
2024-04-13      17.0       10    5900.0
2024-04-14      14.0       12   12000.0